In [74]:
import pandas as pd
import numpy as np
from zipfile import ZipFile

In [75]:
pd.set_option('display.max_columns', None)

In [76]:
zf = ZipFile('../../Data/sim_av_patient.zip')
csv = zf.open('sim_av_patient.csv')
df = pd.read_csv(csv)
df.head()

,PATIENTID,SEX,LINKNUMBER,ETHNICITY,DEATHCAUSECODE_1A,DEATHCAUSECODE_1B,DEATHCAUSECODE_1C,DEATHCAUSECODE_2,DEATHCAUSECODE_UNDERLYING,DEATHLOCATIONCODE,NEWVITALSTATUS,VITALSTATUSDATE
0,10000001,2,810000001,A,NaN,NaN,NaN,NaN,NaN,NaN,A,2017-01-17
1,10000002,2,810000002,Z,NaN,NaN,NaN,NaN,NaN,NaN,A,2017-01-14
2,10000003,1,810000003,A,NaN,NaN,NaN,NaN,NaN,NaN,A,2017-01-17
3,10000004,1,810000004,A,NaN,NaN,NaN,NaN,NaN,NaN,A,2017-01-13
4,10000005,2,810000005,NaN,NaN,NaN,NaN,NaN,NaN,NaN,A,2017-01-16

In [77]:
df.sample(5)

,PATIENTID,SEX,LINKNUMBER,ETHNICITY,DEATHCAUSECODE_1A,DEATHCAUSECODE_1B,DEATHCAUSECODE_1C,DEATHCAUSECODE_2,DEATHCAUSECODE_UNDERLYING,DEATHLOCATIONCODE,NEWVITALSTATUS,VITALSTATUSDATE
69191,10070420,1,810070420,NaN,NaN,NaN,NaN,NaN,NaN,NaN,A,2017-01-14
220293,10224083,2,810224083,A,J189,NaN,NaN,N179,I64,X,A,2017-01-16
903809,90043766,1,890043766,A,J690,NaN,NaN,NaN,C259,1,D,2016-01-26
246024,10250278,1,810250278,A,NaN,NaN,NaN,NaN,NaN,NaN,A,2017-01-17
1029064,120035499,2,920035499,A,C851,C837,NaN,I255 Y839 I64,C851,1,A,2017-01-16

In [78]:
df.shape

(1322100, 12)

In [79]:
df.isna().sum()

PATIENTID                          0
SEX                                0
LINKNUMBER                         0
ETHNICITY                     129851
DEATHCAUSECODE_1A             991820
DEATHCAUSECODE_1B            1224015
DEATHCAUSECODE_1C            1303994
DEATHCAUSECODE_2             1180118
DEATHCAUSECODE_UNDERLYING     994190
DEATHLOCATIONCODE             991719
NEWVITALSTATUS                     0
VITALSTATUSDATE                    0
dtype: int64

In [80]:
df.count()

PATIENTID                    1322100
SEX                          1322100
LINKNUMBER                   1322100
ETHNICITY                    1192249
DEATHCAUSECODE_1A             330280
DEATHCAUSECODE_1B              98085
DEATHCAUSECODE_1C              18106
DEATHCAUSECODE_2              141982
DEATHCAUSECODE_UNDERLYING     327910
DEATHLOCATIONCODE             330381
NEWVITALSTATUS               1322100
VITALSTATUSDATE              1322100
dtype: int64

In [81]:
df.dtypes

PATIENTID                     int64
SEX                           int64
LINKNUMBER                    int64
ETHNICITY                    object
DEATHCAUSECODE_1A            object
DEATHCAUSECODE_1B            object
DEATHCAUSECODE_1C            object
DEATHCAUSECODE_2             object
DEATHCAUSECODE_UNDERLYING    object
DEATHLOCATIONCODE            object
NEWVITALSTATUS               object
VITALSTATUSDATE              object
dtype: object

In [82]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1322100 entries, 0 to 1322099
Data columns (total 12 columns):
PATIENTID                    1322100 non-null int64
SEX                          1322100 non-null int64
LINKNUMBER                   1322100 non-null int64
ETHNICITY                    1192249 non-null object
DEATHCAUSECODE_1A            330280 non-null object
DEATHCAUSECODE_1B            98085 non-null object
DEATHCAUSECODE_1C            18106 non-null object
DEATHCAUSECODE_2             141982 non-null object
DEATHCAUSECODE_UNDERLYING    327910 non-null object
DEATHLOCATIONCODE            330381 non-null object
NEWVITALSTATUS               1322100 non-null object
VITALSTATUSDATE              1322100 non-null object
dtypes: int64(3), object(9)
memory usage: 121.0+ MB

In [83]:
print("The original dataset has data for %d patients" % len(df))
print("After removing duplicates, the dataset has data for %d patients" % len(df.drop_duplicates()))
print("There are no duplicates in the dataset")

The original dataset has data for 1322100 patients
After removing duplicates, the dataset has data for 1322100 patients
There are no duplicates in the dataset

In [84]:
df['NEWVITALSTATUS'].value_counts()

A                                                         991776
D                                                         296625
Potential error: Px interacts after DoDeath                29608
X                                                           1738
Potential error iro DoDeath                                 1371
Potential error: Px traced alive after DoDeath but <2m       815
Potential error: Px treated after DoDeath                    141
Potential error: Px traced alive after DoDeath > 2m           23
Potential error: Px diagnosed after DoDeath                    3
Name: NEWVITALSTATUS, dtype: int64

In [85]:
percentage_alive = np.mean(df['NEWVITALSTATUS'] == 'A') * 100
percentage_dead = np.mean(df['NEWVITALSTATUS'] == 'D') * 100
percentage_others = np.mean((df['NEWVITALSTATUS'] != 'A') & (df['NEWVITALSTATUS'] != 'D')) * 100
print("Percentage of patients classified as alive: %.2f" % percentage_alive)
print("Percentage of patients classified as dead: %.2f" % percentage_dead)
print("Percentage of patients classified as other: %.2f" % percentage_others)

Percentage of patients classified as alive: 75.02
Percentage of patients classified as dead: 22.44
Percentage of patients classified as other: 2.55

In [86]:
df = df.drop(df[(df['NEWVITALSTATUS'] != 'A') & (df['NEWVITALSTATUS'] != 'D')].index)
df.head()

,PATIENTID,SEX,LINKNUMBER,ETHNICITY,DEATHCAUSECODE_1A,DEATHCAUSECODE_1B,DEATHCAUSECODE_1C,DEATHCAUSECODE_2,DEATHCAUSECODE_UNDERLYING,DEATHLOCATIONCODE,NEWVITALSTATUS,VITALSTATUSDATE
0,10000001,2,810000001,A,NaN,NaN,NaN,NaN,NaN,NaN,A,2017-01-17
1,10000002,2,810000002,Z,NaN,NaN,NaN,NaN,NaN,NaN,A,2017-01-14
2,10000003,1,810000003,A,NaN,NaN,NaN,NaN,NaN,NaN,A,2017-01-17
3,10000004,1,810000004,A,NaN,NaN,NaN,NaN,NaN,NaN,A,2017-01-13
4,10000005,2,810000005,NaN,NaN,NaN,NaN,NaN,NaN,NaN,A,2017-01-16

In [87]:
df['NEWVITALSTATUS'].value_counts()

A    991776
D    296625
Name: NEWVITALSTATUS, dtype: int64

In [88]:
percentage_alive = np.mean(df['NEWVITALSTATUS'] == 'A') * 100
percentage_dead = np.mean(df['NEWVITALSTATUS'] == 'D') * 100
percentage_others = np.mean((df['NEWVITALSTATUS'] != 'A') & (df['NEWVITALSTATUS'] != 'D')) * 100
print("New percentage of patients classified as alive: %.2f" % percentage_alive)
print("New percentage of patients classified as dead: %.2f" % percentage_dead)
print("New percentage of patients classified as other: %.2f" % percentage_others)

New percentage of patients classified as alive: 76.98
New percentage of patients classified as dead: 23.02
New percentage of patients classified as other: 0.00

In [89]:
correct_alive = df[(df['NEWVITALSTATUS'] == 'A') & (df['DEATHCAUSECODE_1A'].isna()) & (df['DEATHCAUSECODE_1B'].isna()) & (df['DEATHCAUSECODE_1C'].isna()) & (df['DEATHCAUSECODE_2'].isna()) & (df['DEATHCAUSECODE_UNDERLYING'].isna()) & (df['DEATHLOCATIONCODE'].isna())]
correct_alive

,PATIENTID,SEX,LINKNUMBER,ETHNICITY,DEATHCAUSECODE_1A,DEATHCAUSECODE_1B,DEATHCAUSECODE_1C,DEATHCAUSECODE_2,DEATHCAUSECODE_UNDERLYING,DEATHLOCATIONCODE,NEWVITALSTATUS,VITALSTATUSDATE
0,10000001,2,810000001,A,NaN,NaN,NaN,NaN,NaN,NaN,A,2017-01-17
1,10000002,2,810000002,Z,NaN,NaN,NaN,NaN,NaN,NaN,A,2017-01-14
2,10000003,1,810000003,A,NaN,NaN,NaN,NaN,NaN,NaN,A,2017-01-17
3,10000004,1,810000004,A,NaN,NaN,NaN,NaN,NaN,NaN,A,2017-01-13
4,10000005,2,810000005,NaN,NaN,NaN,NaN,NaN,NaN,NaN,A,2017-01-16
...,...,...,...,...,...,...,...,...,...,...,...,...
1322090,220048564,1,1020048564,A,NaN,NaN,NaN,NaN,NaN,NaN,A,2017-01-16
1322094,220048569,1,1020048569,A,NaN,NaN,NaN,NaN,NaN,NaN,A,2017-01-14
1322095,220048570,1,1020048570,A,NaN,NaN,NaN,NaN,NaN,NaN,A,2017-01-16
1322096,220048571,2,1020048571,A,NaN,NaN,NaN,NaN,NaN,NaN,A,2017-01-16
1322098,220048573,2,1020048573,A,NaN,NaN,NaN,NaN,NaN,NaN,A,2017-01-16

In [90]:
correct_dead = df[(df['NEWVITALSTATUS'] == 'D') & ((df['DEATHCAUSECODE_1A'].notna()) | (df['DEATHCAUSECODE_1B'].notna()) | (df['DEATHCAUSECODE_1C'].notna()) | (df['DEATHCAUSECODE_2'].notna()) | (df['DEATHCAUSECODE_UNDERLYING'].notna()) | (df['DEATHLOCATIONCODE'].notna()))]
correct_dead

,PATIENTID,SEX,LINKNUMBER,ETHNICITY,DEATHCAUSECODE_1A,DEATHCAUSECODE_1B,DEATHCAUSECODE_1C,DEATHCAUSECODE_2,DEATHCAUSECODE_UNDERLYING,DEATHLOCATIONCODE,NEWVITALSTATUS,VITALSTATUSDATE
11,10000013,2,810000013,A,C241,NaN,NaN,NaN,C809,4,D,2016-02-03
55,10000058,1,810000058,A,J189,NaN,K562,F03,"W190,S720",1,D,2015-05-14
429,10000438,2,810000438,A,I259,NaN,NaN,NaN,G20,4,D,2015-07-25
581,10000590,2,810000590,A,J180,NaN,NaN,I501,I64,4,D,2014-05-07
918,10000936,1,810000936,A,C443,"R688,R54",NaN,"C809,C959",R688,X,D,2014-12-14
...,...,...,...,...,...,...,...,...,...,...,...,...
1322038,220048507,1,1020048507,A,NaN,NaN,NaN,"I500,C950",NaN,NaN,D,2016-03-10
1322047,220048517,1,1020048517,A,NaN,NaN,NaN,"I251,E119,C349",NaN,NaN,D,2015-09-12
1322065,220048536,2,1020048536,A,D320,G936,NaN,NaN,I219,1,D,2016-10-09
1322068,220048540,2,1020048540,A,J180,NaN,NaN,NaN,C61,4,D,2014-10-18
1322080,220048552,1,1020048552,A,C349,NaN,NaN,NaN,D432,2,D,2014-04-17

In [91]:
df = correct_alive.merge(correct_dead, how = 'outer')
df.head()

,PATIENTID,SEX,LINKNUMBER,ETHNICITY,DEATHCAUSECODE_1A,DEATHCAUSECODE_1B,DEATHCAUSECODE_1C,DEATHCAUSECODE_2,DEATHCAUSECODE_UNDERLYING,DEATHLOCATIONCODE,NEWVITALSTATUS,VITALSTATUSDATE
0,10000001,2,810000001,A,NaN,NaN,NaN,NaN,NaN,NaN,A,2017-01-17
1,10000002,2,810000002,Z,NaN,NaN,NaN,NaN,NaN,NaN,A,2017-01-14
2,10000003,1,810000003,A,NaN,NaN,NaN,NaN,NaN,NaN,A,2017-01-17
3,10000004,1,810000004,A,NaN,NaN,NaN,NaN,NaN,NaN,A,2017-01-13
4,10000005,2,810000005,NaN,NaN,NaN,NaN,NaN,NaN,NaN,A,2017-01-16

In [92]:
df.shape

(982482, 12)

In [93]:
print("The original dataset had 1322100 patients") 
print("The dataset with only valid data has %d patients" % len(df))
print("A total of %d patients are deleted" % (1322100 - len(df)))

The original dataset had 1322100 patients
The dataset with only valid data has 982482 patients
A total of 339618 patients are deleted

In [94]:
percentage_alive = np.mean(df['NEWVITALSTATUS'] == 'A') * 100
percentage_dead = np.mean(df['NEWVITALSTATUS'] == 'D') * 100
print("Final percentage of patients classified as alive: %.2f" % percentage_alive)
print("Final percentage of patients classified as dead: %.2f" % percentage_dead)

Final percentage of patients classified as alive: 83.50
Final percentage of patients classified as dead: 16.50

In [95]:
df.columns

Index(['PATIENTID', 'SEX', 'LINKNUMBER', 'ETHNICITY', 'DEATHCAUSECODE_1A',
       'DEATHCAUSECODE_1B', 'DEATHCAUSECODE_1C', 'DEATHCAUSECODE_2',
       'DEATHCAUSECODE_UNDERLYING', 'DEATHLOCATIONCODE', 'NEWVITALSTATUS',
       'VITALSTATUSDATE'],
      dtype='object')

In [96]:
columns_selected = ['PATIENTID', 'SEX', 'LINKNUMBER', 'ETHNICITY', 'NEWVITALSTATUS', 'VITALSTATUSDATE']
df = df[columns_selected]
df.head()

   PATIENTID  SEX  LINKNUMBER ETHNICITY NEWVITALSTATUS VITALSTATUSDATE
0   10000001    2   810000001         A              A      2017-01-17
1   10000002    2   810000002         Z              A      2017-01-14
2   10000003    1   810000003         A              A      2017-01-17
3   10000004    1   810000004         A              A      2017-01-13
4   10000005    2   810000005       NaN              A      2017-01-16

In [97]:
original_memory = df.memory_usage(deep=True).sum() / 1024**2 
print('Memory used: %.1f MB' % original_memory)

Memory used: 212.9 MB

In [98]:
df.dtypes

PATIENTID           int64
SEX                 int64
LINKNUMBER          int64
ETHNICITY          object
NEWVITALSTATUS     object
VITALSTATUSDATE    object
dtype: object

In [99]:
df['NEWVITALSTATUS'].value_counts()

A    820411
D    162071
Name: NEWVITALSTATUS, dtype: int64

In [100]:
df['NEWVITALSTATUS'] = df['NEWVITALSTATUS'].astype('category')

In [101]:
df['ETHNICITY'].value_counts()

A    761503
C     28421
Z     26426
S      8111
B      8070
X      7937
H      6676
M      5867
N      3833
J      3832
L      3667
P      2113
R      1548
G      1303
K      1159
D       841
F       631
0       462
E       401
8        29
Name: ETHNICITY, dtype: int64

In [102]:
# df['ETHNICITY'] = df['ETHNICITY'].astype(str)
def ethnicity(value):
    if value == 'A':
        return 'White British'
    elif value == 'C':
        return 'Other white background'
    elif value == 'S':
        return 'Other ethnic group'
    elif value == 'B':
        return 'White Irish'
    elif value == 'H':
        return 'Asian Indian'
    elif value == 'M':
        return 'Black Caribbean'
    elif value == 'N':
        return 'Black African'
    elif value == 'J':
        return 'Asian Pakistani'
    elif value == 'L':
        return 'Other Asian background'
    elif value == 'P':
        return 'Other black background'
    elif value == 'R':
        return 'Chinese'
    elif value == 'G':
        return 'Other mixed background'
    elif value == 'K':
        return 'Asian Bangladeshi'
    elif value == 'D':
        return 'White and black Caribbean'
    elif value == 'F':
        return 'Mixed white and Asian'
    elif value == 'E':
        return 'Mixed white and black African'
    elif value == '0':
        return 'White'
    elif value == '8':
        return 'Other'
    elif value == 'Z' or value == 'X' or value == 'nan':
        return np.nan
    else:
        return value

df['ETHNICITY'] = df['ETHNICITY'].apply(ethnicity)    
df['ETHNICITY'].value_counts()

White British                    761503
Other white background            28421
Other ethnic group                 8111
White Irish                        8070
Asian Indian                       6676
Black Caribbean                    5867
Black African                      3833
Asian Pakistani                    3832
Other Asian background             3667
Other black background             2113
Chinese                            1548
Other mixed background             1303
Asian Bangladeshi                  1159
White and black Caribbean           841
Mixed white and Asian               631
White                               462
Mixed white and black African       401
Other                                29
Name: ETHNICITY, dtype: int64

In [103]:
df['ETHNICITY'] = df['ETHNICITY'].astype('category')

In [104]:
df['VITALSTATUSDATE'].sort_values()

896736    2013-01-02
954025    2013-01-02
882729    2013-01-02
945077    2013-01-02
893435    2013-01-02
             ...
36199     2017-01-31
812082    2017-01-31
641276    2017-02-01
346951    2017-02-02
373966    2017-02-02
Name: VITALSTATUSDATE, Length: 982482, dtype: object

In [106]:
df['SEX'].value_counts()

2    515398
1    467084
Name: SEX, dtype: int64

In [107]:
def sex(value):
    if value == 1:
        return 'M'
    elif value == 2:
        return 'F'
    else:
        return value

df['SEX'] = df['SEX'].apply(sex)    
df['SEX'].value_counts()

F    515398
M    467084
Name: SEX, dtype: int64

In [108]:
df = df[df['SEX'] == 'F']
df.head()

    PATIENTID SEX  LINKNUMBER      ETHNICITY NEWVITALSTATUS VITALSTATUSDATE
0    10000001   F   810000001  White British              A      2017-01-17
1    10000002   F   810000002            NaN              A      2017-01-14
4    10000005   F   810000005            NaN              A      2017-01-16
6    10000008   F   810000008            NaN              A      2017-01-16
10   10000014   F   810000014  White British              A      2017-01-16

In [109]:
df['SEX'] = df['SEX'].astype('category')

In [110]:
new_memory = df.memory_usage(deep = True).sum() / 1024 ** 2 
print('Memory used: %.1f MB' % new_memory)

Memory used: 46.2 MB

In [111]:
df.count()

PATIENTID          515398
SEX                515398
LINKNUMBER         515398
ETHNICITY          435367
NEWVITALSTATUS     515398
VITALSTATUSDATE    515398
dtype: int64

In [112]:
df.shape

(515398, 6)

In [114]:
df.isna().sum()

PATIENTID              0
SEX                    0
LINKNUMBER             0
ETHNICITY          80031
NEWVITALSTATUS         0
VITALSTATUSDATE        0
dtype: int64

In [115]:
df.dtypes

PATIENTID             int64
SEX                category
LINKNUMBER            int64
ETHNICITY          category
NEWVITALSTATUS     category
VITALSTATUSDATE      object
dtype: object

In [156]:
# df.csv('./Data/avpat.csv', sep='^')

In [116]:
df.to_pickle('./Data/avpat.pickle')